package com.jsu.dao;

import java.util.Random;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Customer {
			//定义姓氏
			private static String firstName="赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯咎管卢莫经房裘缪干解应宗宣丁贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄魏加封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘姜詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲台从鄂索咸籍赖卓蔺屠蒙池乔阴郁胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍却璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庚终暨居衡步都耿满弘匡国文寇广禄阙东殴殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查后江红游竺权逯盖益桓公万俟司马上官欧阳夏侯诸葛闻人东方赫连皇甫尉迟公羊澹台公冶宗政濮阳淳于仲孙太叔申屠公孙乐正轩辕令狐钟离闾丘长孙慕容鲜于宇文司徒司空亓官司寇仉督子车颛孙端木巫马公西漆雕乐正壤驷公良拓拔夹谷宰父谷粱晋楚阎法汝鄢涂钦段干百里东郭南门呼延归海羊舌微生岳帅缑亢况后有琴梁丘左丘东门西门商牟佘佴伯赏南宫墨哈谯笪年爱阳佟第五言福百家姓续";
			//定义女生的名
			private static String girl="秀娟英华慧巧美娜静淑惠珠翠雅芝玉萍红娥玲芬芳燕彩春菊兰凤洁梅琳素云莲真环雪荣爱妹霞香月莺媛艳瑞凡佳嘉琼勤珍贞莉桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩婷姣婉娴瑾颖露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚苑婕馨瑗琰韵融园艺咏卿聪澜纯毓悦昭冰爽琬茗羽希宁欣飘育滢馥筠柔竹霭凝晓欢霄枫芸菲寒伊亚宜可姬舒影荔枝思丽 ";
			//定义男生的名
		    private static String boy="伟刚勇毅俊峰强军平保东文辉力明永健世广志义兴良海山仁波宁贵福生龙元全国胜学祥才发武新利清飞彬富顺信子杰涛昌成康星光天达安岩中茂进林有坚和彪博诚先敬震振壮会思群豪心邦承乐绍功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗伯宏言若鸣朋斌梁栋维启克伦翔旭鹏泽晨辰士以建家致树炎德行时泰盛雄琛钧冠策腾楠榕风航弘";
		    public static int getNum(int start,int end) {//随机返回返回指定范围间的整数
		    	//Math.random()随机返回0.0至1.0之间的数
		        return (int)(Math.random()*(end-start+1)+start);
		    }
		    //随机返回账号
		    public static String getAccnum() {//不使用String，因为需要大量拼接字符串
		    	String zh=new String("2019");//账号前4位相同
		    	StringBuilder zh1=new StringBuilder(String.valueOf(getNum(0,9999)));//随机取后4位
		    	if(zh1.length()==1) {
		    		zh1=zh1.insert(0, "000");//如果是1位数，前面增加3个0
		    		zh=zh+zh1;//前6位与后3位拼接成学号
		    	}else if(zh1.length()==2) {
		    		zh1=zh1.insert(0, "00");//如果是2位数，前面增加2个0
		    		zh=zh+zh1;
		    	}else if(zh1.length()==3) {
		    		zh1=zh1.insert(0, "0");//如果是3位数，前面增加1个0
		    		zh=zh+zh1;
		    	}else {
		    		zh=zh+zh1;
		    	}
		    	return zh;
		    }
		    //随机返回中文姓名 
		    public static String getChineseName() {
		        int index=getNum(0, firstName.length()-1);//随机取姓氏字符串中的任意位置
		        String first=firstName.substring(index, index+1);//获取该位置的姓氏
		        int sex=getNum(0,1);//随机取性别，例如1为男生，0为女生
		        String str=boy;//定义名字为男生字符串
		        int length=boy.length();//获取男生字符串的长度
		        if(sex==0){//如果随机获取为0，则名字改为女生
		            str=girl;
		            length=girl.length();
		        }
		        index=getNum(0,length-1);//随机获取名字的位置
		        String second=str.substring(index, index+1);//获取该位置中的名字
		        int hasThird=getNum(0,1);//随机获取名字是否有第三个字
		        String third="";//默认没有第三个字
		        if(hasThird==1){//如果随机获取为1，则有第三个字
		            index=getNum(0,length-1);
		            third=str.substring(index, index+1);
		        }
		        return first+second+third;//返回姓名
		    }
		    //随机返回性别
		    public static String getSex() {
		    	String sex=null;
		    	int s=getNum(0,1);
		    	if(s==1) {
		    		sex="男";
		    	}else {
		    		sex="女";
		    	}
		    	return sex;
		    }
		    //随机返回地址
		    public static String getProCity(){

		        String[] province = {"河北省","山西省","辽宁省","吉林省","黑龙江省","江苏省","浙江省","安徽省","福建省","江西省","山东省","河南省","湖北省","湖南省","广东省","海南省","四川省","贵州省","云南省","陕西省","甘肃省","青海省","台湾省",};
		        String[] city = {"安康市","安庆市","安顺市","安阳市","鞍山市","巴彦淖尔市","巴中市","白城市","白山市","白银市","百色市","蚌埠市","包头市","宝鸡市","保定市","保山市","北海市","本溪市","滨州市","沧州市","昌都地区","长春市","长沙市","长治市","常德市","常州市","巢湖市","朝阳市","潮州市","郴州市","成都市","承德市","池州市","赤峰市","崇左市","滁州市","达州市","大连市","大庆市","大同市","丹东市","德阳市","德州市","定西市","东莞市","东营市","鄂尔多斯市","鄂州市","防城港市","佛山市","福州市","抚顺市","抚州市","阜新市","阜阳市","甘南州","赣州市","固原市","广安市","广元市","广州市","贵港市","贵阳市","桂林市","哈尔滨市","哈密地区","海北藏族自治州","海东地区","海口市","邯郸市","汉中市","杭州市","毫州市","合肥市","河池市","河源市","菏泽市","贺州市","鹤壁市","鹤岗市","黑河市","衡水市","衡阳市","呼和浩特市","呼伦贝尔市","湖州市","葫芦岛市","怀化市","淮安市","淮北市","淮南市","黄冈市","黄山市","黄石市","惠州市","鸡西市","吉安市","吉林市","济南市","济宁市","佳木斯市","嘉兴市","嘉峪关市","江门市","焦作市","揭阳市","金昌市","金华市","锦州市","晋城市","晋中市","荆门市","荆州市","景德镇市","九江市","酒泉市","开封市","克拉玛依市","昆明市","拉萨市","来宾市","莱芜市","兰州市","廊坊市","乐山市","丽江市","丽水市","连云港市","辽阳市","辽源市","聊城市","临沧市","临汾市","临沂市","柳州市","六安市","六盘水市","龙岩市","陇南市","娄底市","泸州市","吕梁市","洛阳市","漯河市","马鞍山市","茂名市","眉山市","梅州市","绵阳市","牡丹江市","内江市","南昌市","南充市","南京市","南宁市","南平市","南通市","南阳市","宁波市","宁德市","攀枝花市","盘锦市","平顶山市","平凉市","萍乡市","莆田市","濮阳市","普洱市","七台河市","齐齐哈尔市","钦州市","秦皇岛市","青岛市","清远市","庆阳市","曲靖市","衢州市","泉州市","日照市","三门峡市","三明市","三亚市","汕头市","汕尾市","商洛市","商丘市","上饶市","韶关市","邵阳市","绍兴市","深圳市","沈阳市","十堰市","石家庄市","石嘴山市","双鸭山市","朔州市","四平市","松原市","苏州市","宿迁市","宿州市","绥化市","随州市","遂宁市","台州市","太原市","泰安市","泰州市","唐山市","天水市","铁岭市","通化市","通辽市","铜川市","铜陵市","铜仁市","吐鲁番地区","威海市","潍坊市","渭南市","温州市","乌海市","乌兰察布市","乌鲁木齐市","无锡市","吴忠市","芜湖市","梧州市","武汉市","武威市","西安市","西宁市","锡林郭勒盟","厦门市","咸宁市","咸阳市","湘潭市","襄樊市","孝感市","忻州市","新乡市","新余市","信阳市","兴安盟","邢台市","徐州市","许昌市","宣城市","雅安市","烟台市","延安市","盐城市","扬州市","阳江市","阳泉市","伊春市","伊犁哈萨克自治州","宜宾市","宜昌市","宜春市","益阳市","银川市","鹰潭市","营口市","永州市","榆林市","玉林市","玉溪市","岳阳市","云浮市","运城市","枣庄市","湛江市","张家界市","张家口市","张掖市","漳州市","昭通市","肇庆市","镇江市","郑州市","中山市","中卫市","舟山市","周口市","株洲市","珠海市","驻马店市","资阳市","淄博市","自贡市","遵义市",};
		        String[] area = {"伊春区","带岭区","南岔区","金山屯区","西林区","美溪区","乌马河区","翠峦区","友好区","新青区","上甘岭区","五营区","红星区","汤旺河区","乌伊岭区","榆次区"};
		        String[] road = {"爱国路","安边路","安波路","安德路","安汾路","安福路","安国路","安化路","安澜路","安龙路","安仁路","安顺路","安亭路","安图路","安业路","安义路","安远路","鞍山路","鞍山支路","澳门路","八一路","巴林路","白城路","白城南路","白渡路","白渡桥","白兰路","白水路","白玉路","百安路（方泰镇）","百官街","百花街","百色路","板泉路","半淞园路","包头路","包头南路","宝安公路","宝安路","宝昌路","宝联路","宝林路","宝祁路","宝山路","宝通路","宝杨路","宝源路","保德路","保定路","保屯路","保屯路","北艾路",};
		        String[] home = {"金色家园","耀江花园","阳光翠竹苑","东新大厦","溢盈河畔别墅","真新六街坊","和亭佳苑","协通公寓","博泰新苑","菊园五街坊","住友嘉馨名园","复华城市花园","爱里舍花园"};

		        Random random = new Random();
		        int randomProvinceNum = random.nextInt(province.length);
		        int randomCityNum = random.nextInt(city.length);
		        int randomAreaNum = random.nextInt(area.length);
		        int randomRoadNum = random.nextInt(road.length);
		        int randomHomeNum = random.nextInt(home.length);
		        int num = random.nextInt(200);
		        return province[randomProvinceNum]+city[randomAreaNum]+area[randomAreaNum]+road[randomRoadNum]+num+"号"+home[randomHomeNum];
		    }
		 // 判断是否电话格式
			public static boolean isMobileNO(String mobiles) {
		 
				Pattern pattern = Pattern.compile("^((13[0-9])|(15[^4,\\D])|(18[0,5-9]))\\d{8}$");
		 
				Matcher matcher = pattern.matcher(mobiles);
		 
				return matcher.matches();
			}
		 // 生成长度为9的随机数
		 			public static String randomNumber() {
		 		 
		 				Random random = new Random();
		 				int nextInt = random.nextInt(900000000) + 100000000;
		 				int abs = Math.abs(nextInt);
		 				String valueOf = String.valueOf(abs);
		 				return valueOf;
		 			}
		 // 产生随机电话号码格式数字
			public static String randomPhone() {
				String phone = "1";
		 
				Random random = new Random();
				int nextInt = random.nextInt(3);
		 
				if (nextInt == 0) {
					phone = phone + "3" + randomNumber();
				} else if (nextInt == 1) {
					phone = phone + "5" + randomNumber();
				} else {
					phone = phone + "8" + randomNumber();
				}
				return phone;
			}
		 // 返回随机电话号码
			public static String getMobile() {
		 
				while (true) {
					String randomPhone = randomPhone();
					if (isMobileNO(randomPhone)) {
						return randomPhone;
					}
		 
				}
		 
			}
}
